ledna.org
#+CATEGORY: ledna
#+PROPERTY: header-args:emacs-lisp :tangle yes :results silent

* Hello
#+begin_src emacs-lisp
;;; ledna.el --- try to make edna more flexible and familiar to emacs-lisp developers

;; Copyright (C) 2019 Dmitry Akatov

;; Author: Dmitry Akatov <akatovda@yandex.com>
;; Created: 17 Feb 2019
;; Version: 0.1

;; Keywords: org babel
;; Homepage: https://github.com/rails-to-cosmos/org-literate-devtools

;; This file is not part of GNU Emacs.

;; This program is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

;;; Commentary:
;; This package allows you to manage bookmarks and travel around the
;; digital world with an org-mode power behind your shoulders.

;;; Code:
#+end_src
* TODO Make it on top of org-element API
* Documentation
** Property prefix rules
| Prefix | Description        |
|--------+--------------------|
| _PROP  | Protected property |
| __PROP | Private property   |
| $PROP  | Selector property  |
| #PROP  | Blocker property   |
** State trigger descriptors
| Property   | Description                                    |
|------------+------------------------------------------------|
| :*:        | Triggers on any state change                   |
| :FROM->TO: | Triggers on state change from FROM to TO state |
| :->TO:     | Triggers on state change from none to TO state |
| :*->TO:    | Triggers on state change from any to TO state  |
** Examples
*** TODO Effort logging (goto-char org-clock-marker)
SCHEDULED: <2018-05-13 Sun 13:00>
:PROPERTIES:
:EFFORT:   01:45
:TODO->DONE: (ledna/consider-effort-as-clocktime) ;; task was not clocked-in because of TODO state, but it has been DONE. Considering effort as task clocktime.
:END:
*** TODO State Switchers
:PROPERTIES:
:*:        (message "Todo state has been changed")
:TODO->*:  (message "Todo state has been changed from TODO")
:*->DONE:  (message "Todo state has been changed to DONE")
:*->TODO:  (message "Todo state has been changed to TODO")
:#*->CANCELLED: t ;; never allow switch state to CANCELLED
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2018-05-13 Sun 00:45]
- State "DONE"       from "TODO"       [2018-05-13 Sun 00:45]
- State "DONE"       from "TODO"       [2018-05-13 Sun 00:47]
- State "DONE"       from "TODO"       [2018-05-13 Sun 00:48]
- State "DONE"       from "TODO"       [2018-05-13 Sun 00:48]
- State "DONE"       from "TODO"       [2018-05-13 Sun 13:54]
:END:
* Core
** Wrapper
#+BEGIN_SRC emacs-lisp
(defun ledna/eval-forms (forms)
  (unwind-protect
      (mapc #'(lambda (f) (when f (eval (read f)))) forms)
    t))

(defun ledna/get-entry-values-by-keys (pom keys)
  (remove 'nil (mapcar #'(lambda (f) (org-entry-get pom f org-edna-use-inheritance)) keys)))

(defun ledna/apply-magic-tag (tag keys)
  (let* ((params (alist-get tag ledna/magic-tags))
         (priority (cadr params))
         (props (car params)))
    (loop for key in keys
          do (when-let (magic-form (car (alist-get (intern key) props)))
               (eval magic-form)))
    priority))

(defun ledna--apply-magic-tag-consider-priority (tag priority keys vals &optional entry-props-evaled-p)
  (when (and vals
             (not entry-props-evaled-p)
             (>= priority 100))
    (ledna/eval-forms vals)
    (setq entry-props-evaled-p t))
  (ledna/apply-magic-tag tag keys)
  entry-props-evaled-p)

(defun apply-ledna-forms (entry-keys pom)
  (save-excursion
    (org-goto-marker-or-bmk pom)

    (let (entry-props-evaled-p
          (magic-tags (ledna/magic-tags-list))
          (complex-tags (ledna/complex-tags-list))
          (entry-vals (ledna/get-entry-values-by-keys pom entry-keys))
          (src-org-tags (mapcar #'intern (org-get-tags))))

      ;; Process complex tags
      (dolist (src-tag src-org-tags)
        (when (member src-tag complex-tags)
          (let* ((sm-tags (car (alist-get src-tag ledna/complex-tags))))
            (loop for (tag priority)
                  in (ledna/tags-prioritized magic-tags)
                  when (member tag sm-tags)
                  do (setq entry-props-evaled-p
                           (ledna--apply-magic-tag-consider-priority
                            tag priority
                            entry-keys entry-vals
                            entry-props-evaled-p))))))

      ;; Process simple tags (minor copy-paste)
      (loop for (tag priority)
            in (ledna/tags-prioritized magic-tags)
            when (member tag src-org-tags)
            do (setq entry-props-evaled-p
                     (ledna--apply-magic-tag-consider-priority
                      tag priority
                      entry-keys entry-vals
                      entry-props-evaled-p)))

      ;; Process user properties
      (when (and entry-vals (not entry-props-evaled-p))
        (ledna/eval-forms entry-vals)))))

(defun ledna-trigger-function-emacs-lisp (change-plist)
  "Trigger function work-horse.

See `org-edna-run' for CHANGE-PLIST explanation.

This shouldn't be run from outside of `org-trigger-hook'."
  (let* ((pos (plist-get change-plist :position))

         (to* (or (plist-get change-plist :to) ""))
         (from* (or (plist-get change-plist :from) ""))

         (to (cond ((symbolp to*) (symbol-name to*))
                   ((stringp to*) (substring-no-properties to*))))
         (from (cond ((symbolp from*) (symbol-name from*))
                     ((stringp from*) (substring-no-properties from*))))

         (prop-templates
          (list (format "%s->%s" from to)
                (format "%s->*" from)
                (format "*->%s" to)
                "*"
                "*->*")))

    (apply-ledna-forms prop-templates pos)))

(defun ledna-blocker-function-emacs-lisp (change-plist)
  "Trigger function work-horse.

See `org-edna-run' for CHANGE-PLIST explanation.

This shouldn't be run from outside of `org-trigger-hook'."
  (let* ((pos (plist-get change-plist :position))
         (type (plist-get change-plist :type))
         (to* (or (plist-get change-plist :to) ""))
         (from* (or (plist-get change-plist :from) ""))
         (to (cond ((symbolp to*) (symbol-name to*))
                   ((stringp to*) (substring-no-properties to*))))
         (from (cond ((symbolp from*) (symbol-name from*))
                     ((stringp from*) (substring-no-properties from*))))

         (prop-templates
          (list (format "#%s->%s" from to)
                (format "#%s->*" from)
                (format "#*->%s" to)
                "#*" "#*->*")))

    (ledna-run change-plist
      (if-let ((forms (remove 'nil (mapcar #'(lambda (tpl) (org-entry-get pos tpl org-edna-use-inheritance)) prop-templates))))
          (not (setq org-block-entry-blocking (not (some 'null (mapcar #'(lambda (form) (eval (read form))) forms)))))
        t))))


(defmacro ledna-run (change-plist &rest body)
  "Run a TODO state change.

The state information is held in CHANGE-PLIST.

If the TODO state is changing from a TODO state to a DONE state, run BODY."
  (declare (indent 1))
  `(if (eq (plist-get ,change-plist :type) 'todo-state-change)
       (condition-case-unless-debug err
           ,@body
         (error
          (if (eq (car err) 'invalid-read-syntax)
              (org-edna--print-syntax-error (cdr err))
            (message "Edna Error at heading %s: %s" (org-get-heading t t t) (error-message-string err)))
          (setq org-block-entry-blocking (org-get-heading))
          ;; Block
          nil))
     t))

(defun ledna-dsl-init ()
  (advice-add 'org-edna-trigger-function :around #'ledna-dsl-specifier-trigger)
  (advice-add 'org-edna-blocker-function :around #'ledna-dsl-specifier-blocker))

(defun ledna-dsl-specifier-trigger (orig-fun &rest args)
  "Wrap edna's triggers.

ORIG-FUN is a trigger function called with ARGS."
  (apply #'ledna-trigger-function-emacs-lisp args))

(defun ledna-dsl-specifier-blocker (orig-fun &rest args)
  "Wrap edna's blockers.

ORIG-FUN is a blocker function called with ARGS."
  (apply #'ledna-blocker-function-emacs-lisp args))
#+END_SRC
** Utils
*** ledna/oom
#+BEGIN_SRC emacs-lisp
;; one or many
(defun ledna/oom (items)
  (if (and (listp items) (= (length items) 1))
      (car items)
    items))
#+END_SRC
*** ledna/mos
#+BEGIN_SRC emacs-lisp
;; marker or self
(defun ledna/mos (&optional marker-or-markers)
  (or marker-or-markers (ledna/$self)))
#+END_SRC
