ledna.el

(defun ledna/markers (&optional marker-or-markers)
  (let* ((marker (ledna/mos marker-or-markers))
         (markers (if (markerp marker) (list marker) marker)))
    markers))

(defun ledna/defer (handler &optional marker timeout)
  (run-with-idle-timer (or timeout 2) nil
                       #'(lambda (h s) (ledna/map h s))
                       handler (ledna/mos marker)))

(defun ledna/map (handler &optional marker)
  (save-window-excursion
    (save-excursion
      (loop for mark in (ledna/markers marker)
            collect (progn
                      (org-goto-marker-or-bmk mark)
                      (funcall handler))
            finally (progn
                      (org-align-tags t)
                      (org-update-checkbox-count))))))

(defun string-is-numeric-p (string)
  "Return non-nil if STRING is a valid numeric string.

Examples of valid numeric strings are \"1\", \"-3\", or \"123\"."
  ;; Can't use string-to-number, because it returns 0 if STRING isn't a
  ;; number, which is ambiguous.
  (numberp (car (read-from-string string))))

(defun ledna/org-kill-subtree ()
  (kill-region (org-entry-beginning-position) (org-entry-end-position)))

(defun ledna/rename (title &optional marker)
  (cl-flet ((rename ()
                 (search-forward " ")
                 (org-kill-line)
                 (insert title)))
    (ledna/map #'rename marker)))

(defun ledna-entry-name-from-template ()
  (when-let ((template (or (ledna/get-property ledna-props-template) (cdr (assoc-string "ITEM" (org-entry-properties))))))
    (org-back-to-heading)
    (org-beginning-of-line)
    (org-kill-line)

    (let ((entry-name-format template)
          (entry-name-fmt-args  (org-entry-properties)))
      (insert (s-format entry-name-format 'aget entry-name-fmt-args)))))

(require 's)

(defun ledna-clone (&rest args)
  (save-window-excursion
    (save-excursion
      (org-back-to-heading)

      (let* ((src-entry             (or (plist-get args :source)       (ledna/$self)))
             (src-props             (org-entry-properties))
             (src-props-std         (org-entry-properties nil 'standard))
             (src-props-std-keys    (mapcar #'car src-props-std))
             (src-tags-string       (org-make-tag-string (org-get-tags nil t)))
             (todo-state            (or (plist-get args :todo-state)   "TODO"))
             (target-props          (or (plist-get args :properties)   src-props-std-keys)))

        (org-insert-heading-respect-content)
        (insert (cdr (assoc-string "ITEM" src-props)) " " src-tags-string)

        ;; Copy properties
        (mapc #'(lambda (prop)
                  (when-let (p (assoc-string prop src-props))
                    (condition-case nil
                        (ledna/set-property (car p) (cdr p))
                      (error nil))))
              target-props)

        (ledna/set-todo-state todo-state))
      (org-align-tags t)
      (org-update-checkbox-count))))

(defun ledna/set-property (property value &optional marker)
  (cl-flet ((set-current-prop () (org-entry-put marker property
                                             (cond ((numberp value) (number-to-string value))
                                                   ((stringp value) value)
                                                   (t "Unknown value type")))))
    (ledna/map #'set-current-prop marker)))

(defun ledna/get-property (property &optional marker default)
  (ledna/oom (loop for mark in (ledna/markers marker)
                   for property-value = (or (org-entry-get mark property) default)
                   when (not (eq property-value nil))
                   collect property-value)))

(defun ledna/get-property-read (property &optional marker default)
  (if-let ((pval (ledna/get-property property marker default)))
      (eval (read pval))))

(defun ledna/get-title (&optional target default)
  (ledna/get-property "ITEM" target default))

(defun -ledna/next-value (allowed &optional current)
  (loop for item in allowed with a = -1
        if (or (string= current item)
               (> a -1))
        do (setq a (1+ a))
        if (= a 1) return item
        finally (return (car allowed))))

(defun ledna/switch-to-next-allowed-value (property &optional marker)
  (loop for mark in (ledna/markers marker)
        with current = (ledna/get-property property mark)
        with allowed = (org-property-get-allowed-values mark property)
        when allowed
        do (ledna/set-property property (-ledna/next-value allowed current) mark)))

(defun ledna/cycle-props ()
  (let ((props (ledna/get-property-read ledna-props-cycle)))
    (ledna/map #'(lambda () (mapc 'ledna/switch-to-next-allowed-value props)))))

(defun ledna/inc-property (property &optional val units marker)
  (loop for mark in (ledna/markers marker)
        with result-value
        do (let* ((full-prop-value (ledna/get-property property mark "0"))
                  (inc-value (cond ((and (stringp val) (string-is-numeric-p val)) (string-to-number val))
                                   ((numberp val) val)
                                   (t 1)))
                  (prop-number (string-to-number (car (split-string full-prop-value))))
                  (prop-label (or units (key-description (cdr (split-string full-prop-value))))))
             (setq result-value (s-trim (concat (number-to-string (+ inc-value prop-number)) " " prop-label)))
             (ledna/set-property property result-value mark))
        collect result-value))

(defun ledna/inc-property-get (property &rest args)
  (apply #'ledna/inc-property (append (list property) args))
  (ledna/get-property property))

(defun ledna/get-todo-state (&optional marker)
  (ledna/oom
   (mapcar 'substring-no-properties
           (remove nil (ledna/map 'org-get-todo-state marker)))))

(defun ledna/set-todo-state (state &optional marker)
  (ledna/map #'(lambda () (org-todo state)) marker))

(defun ledna/$children (&optional marker)
  (-flatten (ledna/map 'org-edna-finder/children marker)))

(defun ledna/$parent ()
  (org-edna-finder/parent))

(defun ledna/$self ()
  (save-window-excursion
    (save-excursion
      (org-back-to-heading)
      (list (point-marker)))))

(defun ids (&rest ids)
  "Find a list of headings with given IDS.

Edna Syntax: ids(ID1 ID2 ...)

Each ID is a UUID as understood by `org-id-find'.

Note that in the edna syntax, the IDs don't need to be quoted."
  (mapcar (lambda (id) (org-id-find id 'marker)) ids))

(defun ledna/search (match-spec &optional scope skip)
  "Find entries using Org matching.

Edna Syntax: ledna/search(\"MATCH-SPEC\" SCOPE SKIP)

MATCH-SPEC may be any valid match string; it is passed straight
into `org-map-entries'.

SCOPE and SKIP are their counterparts in `org-map-entries'.
SCOPE defaults to agenda, and SKIP defaults to nil."
  (when match-spec
    (setq scope (or scope 'agenda))
    (org-map-entries
     ;; Find all entries in the agenda files that match the given tag.
     (lambda nil (point-marker))
     match-spec scope skip)))

(defun select (&rest markers)
  (apply #'append markers))
;; (select (ids "test-pass-purchased-p") (tags "test_tag"))
;; TODO (select :ids '(test-pass-purchased-p) :tags '(test_tag))
