ledna.org
**** Effort as clock time
#+BEGIN_SRC emacs-lisp
(defun clocktime-from-timestamp-or-effort ()
  (let* ((timestamp (save-excursion
                      (org-back-to-heading)
                      (re-search-forward org-element--timestamp-regexp
                                         (org-entry-end-position))
                      (goto-char (match-beginning 0))
                      (org-element-timestamp-parser)))
         (start-time (org-timestamp-to-time timestamp))
         (end-time (org-timestamp-to-time timestamp t))
         (effort (/ (float-time (time-subtract end-time start-time)) 60)))

    (unless (> effort 0)
      (setq effort (org-duration-to-minutes
                    (or (ledna/get-property "EFFORT")
                        (let ((user-effort (org-read-property-value "EFFORT")))
                          (org-set-property "EFFORT" user-effort)
                          user-effort))))
      (setq end-time (seconds-to-time (+ (time-to-seconds start-time) (* effort 60)))))

    (with-temp-buffer
      (org-insert-time-stamp start-time 'with-hm 'inactive (concat org-clock-string " "))
      (org-insert-time-stamp end-time 'with-hm 'inactive "--")
      (org-clock-update-time-maybe)
      (buffer-string))))

(defun ledna/consider-effort-as-clocktime ()
  (save-excursion
    (let ((clocktime (clocktime-from-timestamp-or-effort)))
      (org-clock-find-position t)
      (insert-before-markers "\n")
      (backward-char 1)
      (org-indent-line)
      (when (and (save-excursion (end-of-line 0) (org-in-item-p)))
        (beginning-of-line 1)
        (indent-line-to (- (current-indentation) 2)))
      (insert (clocktime-from-timestamp-or-effort))
      (org-back-to-heading)
      (org-set-tags (remove "Effort_Clock" (org-get-tags))))))
#+END_SRC
**** Nearest scheduling
#+begin_src emacs-lisp
(defun ledna/advanced-schedule (&optional target)
  (when-let (schedule (ledna/get-property-read ledna-props-schedule))
    (let ((next-time (ledna/get-nearest-date schedule))
          (org-last-state (ledna/get-todo-state target))
          (todo-word "TODO")
          (done-word "DONE")
          (end (copy-marker (org-entry-end-position))))

      (when (or org-log-repeat
		(catch :clock
		  (save-excursion
		    (while (re-search-forward org-clock-line-re end t)
		      (when (org-at-clock-log-p) (throw :clock t))))))
	(org-entry-put nil "LAST_REPEAT" (format-time-string
					  (org-time-stamp-format t t))))

      (when org-log-repeat
	(if (or (memq 'org-add-log-note (default-value 'post-command-hook))
		(memq 'org-add-log-note post-command-hook))
	    ;; We are already setup for some record.
	    (when (eq org-log-repeat 'note)
	      ;; Make sure we take a note, not only a time stamp.
	      (setq org-log-note-how 'note))
	  ;; Set up for taking a record.
	  (org-add-log-setup 'state
			     (or done-word (car org-done-keywords))
			     org-last-state
			     org-log-repeat)))

      (when org-log-repeat
	(if (or (memq 'org-add-log-note (default-value 'post-command-hook))
		(memq 'org-add-log-note post-command-hook))
	    ;; We are already setup for some record.
	    (when (eq org-log-repeat 'note)
	      ;; Make sure we take a note, not only a time stamp.
	      (setq org-log-note-how 'note))
	  ;; Set up for taking a record.
	  (org-add-log-setup 'state
			     (or done-word (car org-done-keywords))
			     org-last-state
			     org-log-repeat)))

      ;; Time-stamps without a repeater are usually skipped.  However,
      ;; a SCHEDULED time-stamp without one is removed, as they are no
      ;; longer relevant.
      (save-excursion
	(let ((scheduled (org-entry-get (point) "SCHEDULED")))
	  (when (and scheduled (not (string-match-p org-repeat-re scheduled)))
	    (org-remove-timestamp-with-keyword org-scheduled-string))))

      (ledna/set-scheduled next-time target)
      (ledna/set-todo-state todo-word target))))

(defun ledna/get-nearest-date (times)
  (let ((current-sec (time-to-seconds (org-current-time))))
    (cl-flet* ((diff (time)
                     (let* ((target-sec (org-time-string-to-seconds (active-timestamp time)))
                            (diff-sec (- target-sec current-sec)))
                       (cond ((and (> diff-sec 0) (< diff-sec 604800)) diff-sec)
                             ((< diff-sec 0) (+ diff-sec 604800))
                             ((> diff-sec 604800) (- diff-sec 604800)))))
               (comparator (a b) (< (diff a) (diff b))))
      (elt (sort times #'comparator) 0))))
#+end_src
**** Timestamps
#+BEGIN_SRC emacs-lisp
(defun active-timestamp (str)
  (let* ((default-time (org-current-time))
         (decoded-time (decode-time default-time nil))
         (analyzed-time (org-read-date-analyze str default-time decoded-time))
         (encoded-time (apply #'encode-time analyzed-time)))
    (format-time-string (org-time-stamp-format t) encoded-time)))

(defun inactive-timestamp (str)
  (let* ((default-time (org-current-time))
         (decoded-time (decode-time default-time nil))
         (analyzed-time (org-read-date-analyze str default-time decoded-time))
         (encoded-time (apply #'encode-time analyzed-time)))
    (format-time-string (org-time-stamp-format t t) encoded-time)))
#+END_SRC
**** Setters/getters
#+BEGIN_SRC emacs-lisp
(defun ledna/set-scheduled (timestamp &optional marker)
  (let ((mark (or marker (ledna/$self))))
    (save-mark-and-excursion
     (cl-labels
      ((set-scheduled-on (mts)
                         (let ((pom (car mts)) (ts (cdr mts)))
                           (with-current-buffer
                               (marker-buffer pom)
                             (goto-char pom)
                             (org-add-planning-info 'scheduled ts)
                             ts))))
    (mapcar #'set-scheduled-on (-zip mark (-repeat (length mark) timestamp)))))))

(defun ledna/set-deadline (timestamp &optional marker)
  (let ((mark (or marker (ledna/$self))))
    (save-mark-and-excursion
     (cl-labels
      ((set-scheduled-on (mts)
                         (let ((pom (car mts)) (ts (cdr mts)))
                           (with-current-buffer
                               (marker-buffer pom)
                             (goto-char pom)
                             (org-add-planning-info 'deadline ts)
                             ts))))
      (mapcar #'set-scheduled-on (-zip mark (-repeat (length mark) timestamp)))))))
#+END_SRC
* Defaults
** Properties
#+TBLNAME: tbl-ledna-reserved-properties
| Symbol               | Property            | Type                 | Description                                       | Example                         |
|----------------------+---------------------+----------------------+---------------------------------------------------+---------------------------------|
| ledna-props-count    | DONE_COUNT          | int                  | Default counter property                          | 1                               |
| ledna-props-schedule | ADVANCED_SCHEDULE   | list<string>         | Describe repeated scheduling                      | ["Mon 15:00" "Wed" "Fri 18:00"] |
| ledna-props-template | HEADLINE_TEMPLATE   | string               | Header prototype template                         | ${ledna-times} English class    |
| ledna-props-archive  | ARCHIVE_ENTRY_P     | bool                 | Archive entry if t                                | t                               |
| ledna-props-kill     | KILL_ENTRY_P        | bool                 | Kill entry if t                                   | t                               |
| ledna-props-cleanup  | CLEANUP_ENTRY_PROPS | bool or list<string> | Delete entry props if t or props specified        | '("_PRICE" "_PASSED" "_COUNT")  |
| ledna-props-cycle    | CYCLE_ENTRY_PROPS   | list<string>         | Cycle prop values over allowed in PROP_ALL header | '("MONTH" "TRAIN_TYPE")         |
#+TBLFM:

#+NAME: ob-ledna-define-constants
#+BEGIN_SRC emacs-lisp :var ledna-reserved-properties=tbl-ledna-reserved-properties :results org
(loop for (symbol name type descr example) in ledna-reserved-properties
      do (eval (macroexpand (list 'defconst (intern symbol) name
                                  (format "%s. Type = %s." descr type)))))
#+END_SRC

*** ensure-prop
#+begin_src emacs-lisp
(defun ledna/ensure-prop (prop)
  (unless (org-entry-get nil prop)
    (org-set-property prop (read-string (format "Set %s: " prop)))))
#+end_src
