ledna.el

;; priority list of magic tags
;; greater priorities mean latter execution
(setq ledna/magic-tags
      '(;; Tag                Status       Handler                               Priority

        ;; (  Pending_Inherit   ((*->PENDING (ledna/set-todo-state "PENDING" (ledna/$parent)))
        ;;                       (PENDING->* (ledna/set-todo-state "TODO"    (ledna/$parent)))) 1)

        ;; (  *                  ((*->DONE     (ledna/consider-effort-as-clocktime)))           5)

        ;; Constructors
        (  Cycle_Props       ((->TODO       (ledna/cycle-props)))                            1)
        (  Rename            ((->TODO       (ledna-entry-name-from-template)))               1)

        ;; Destructors
        (  Effort_Clock      ((*->DONE (ledna/consider-effort-as-clocktime)))                5)
        (  Advanced_Schedule ((*->DONE      (ledna/advanced-schedule))
                              (*->CANCELLED (ledna/advanced-schedule))
                              (+Advanced_Schedule (ledna/ensure-prop "ADVANCED_SCHEDULE")))  10)

        ;; Uncertain destructors
        (  Cleanup_Maybe      ((*->DONE      (ledna/cleanup-maybe-defer))
                               (*->CANCELLED (ledna/cleanup-maybe-defer)))                   1)
        (  Kill_Maybe         ((*->DONE      (ledna/kill-subtree-maybe-defer))
                               (*->CANCELLED (ledna/kill-subtree-maybe-defer)))              1)
        (  Forget_Unnecessary ((*->CANCELLED (ledna/kill-subtree-maybe-defer)))              1)
        (  Archive_Maybe      ((*->DONE      (ledna/archive-subtree-maybe-defer))
                               (*->CANCELLED (ledna/archive-subtree-maybe-defer)))           1)

        ;; User-defined properties are executed with priority = 100

        ;; So do not confuse yourself:
        ;; use tags that change properties after user-defined triggers.
        (  Counter           ((*->DONE      (ledna/inc-property ledna-props-count)))         110)

        (  Clone             ((*->DONE      (ledna-clone))
                              (*->CANCELLED (ledna-clone)))                                  120)

        ;; Removing entry properties
        ;; Warning! Tags with priority > 1000 don't have access to special properties
        (  Cleanup           ((*->DONE      (ledna/cleanup-properties))
                              (*->CANCELLED (ledna/cleanup-properties)))                     1000)

        ;; Deferred destructors
        (  Kill              ((*->DONE      (ledna/defer 'ledna/org-kill-subtree))
                              (*->CANCELLED (ledna/defer 'ledna/org-kill-subtree)))          1001)

        (  Archive           ((*->DONE      (ledna/defer 'org-archive-subtree))
                              (*->CANCELLED (ledna/defer 'org-archive-subtree)))             1001)))

(setq ledna/complex-tags
      '(;; Complex tag         Features
        (  Repeated_Task     ( Advanced_Schedule Effort_Clock
                               Rename Forget_Unnecessary Cycle_Props))
        (  Reminder          ( Advanced_Schedule Kill))))

(defun ledna/tags-prioritized (tags)
  (loop for (name (status header) priority)
        in (ledna/magic-tags-sorted)
        when (member name tags)
        collect (list name priority)))

(defun ledna/magic-tag-get-priority (tag)
  (cadr (alist-get 'Cleanup ledna/magic-tags)))

(defun ledna/magic-tags-sorted ()
  (sort ledna/magic-tags #'(lambda (a b) (< (caddr a) (caddr b)))))

(defun ledna/magic-tags-list ()
  (mapcar #'car (ledna/magic-tags-sorted)))

(defun ledna/complex-tags-list ()
  (mapcar #'car ledna/complex-tags))

(defun ledna/cleanup-properties (&optional pom)
  (if-let ((cleanup-prop (ledna/get-property ledna-props-cleanup)))
      (if (listp cleanup-prop)
          (mapc #'(lambda (p) (org-delete-property p))
                cleanup-prop)
        (mapc #'(lambda (p) (let ((pname (car p))) (org-delete-property pname)))
              (org-entry-properties nil 'standard)))))

(defun ledna/cleanup-maybe-defer ()
  (ledna/defer #'ledna/cleanup-properties))

(defun ledna/kill-subtree-maybe-defer ()
  (when (string= (ledna/get-property ledna-props-kill) "t")
    (ledna/defer #'ledna/org-kill-subtree)))

(defun ledna/archive-subtree-maybe-defer ()
  (when (string= (ledna/get-property ledna-props-archive) "t")
    (ledna/defer #'org-archive-subtree)))

(defmacro ledna-counter (countable counter &optional target unit)
  `(when-let (inc (cond ((stringp ,countable) (ledna/get-property ,countable ,target))
                        ((numberp ,countable) ,countable)))
     (ledna/inc-property ,counter inc ,unit ,target)))

(defun ledna-price-counter (&optional target unit)
  (ledna-counter "PRICE" "Money" target unit))

(defun ledna-time-counter (&optional target)
  (ledna-counter "DURATION" "Time" target "hours"))

(defun ledna-times-counter (&optional target)
  (ledna-counter 1 "Times" target "times"))

(defun ledna-touch (&optional target)
  (ledna/set-scheduled (active-timestamp "now") target)
  (ledna/set-todo-state "TODO" target))

(defun ledna-money-time-report (&optional target)
  (ledna-time-counter target)
  (ledna-price-counter target)
  (ledna-times-counter target))

(provide 'ledna)
